tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "yarlson/lnk"
brew "asciinema"
brew "bash"
brew "bat"
brew "cmake"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gollama"
brew "gradle"
brew "graphviz"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mergiraf"
brew "mkcert"
brew "neovim"
brew "ollama"
brew "openssh"
brew "pandoc"
brew "pinentry-mac"
brew "shfmt"
brew "sops"
brew "tree"
brew "wget"
brew "yq"
brew "zsh"
brew "qmk/qmk/qmk"
brew "yarlson/lnk/lnk"
cask "1password"
cask "1password-cli"
cask "airbuddy"
cask "balenaetcher"
cask "betterdisplay"
cask "chatwise"
cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "cleanshot"
cask "cursor"
cask "cursor-cli"
cask "cyberduck"
cask "dbngin"
cask "discord"
cask "figma"
cask "font-sf-mono-for-powerline"
cask "fork"
cask "ghidra"
cask "ghostty"
cask "gpg-suite-no-mail"
cask "homerow"
cask "imageoptim"
cask "keyboardcleantool"
cask "lm-studio"
cask "logi-options+"
cask "loopback"
cask "mac-mouse-fix"
cask "macs-fan-control"
cask "master-pdf-editor"
cask "mist"
cask "obs"
cask "orbstack"
cask "parallels"
cask "proxyman"
cask "qflipper"
cask "qlstephen"
cask "qmk-toolbox"
cask "raycast"
cask "rode-connect"
cask "screen-studio"
cask "slack"
cask "tableplus"
cask "tailscale-app"
cask "tuxera-ntfs"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "whatsapp"
cask "yaak"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "alto.computer", id: 6480425094
mas "alto.index", id: 6746674846
mas "alto.photos", id: 6737197282
mas "Boxy SVG", id: 611658502
mas "ColorSlurp", id: 1287239339
mas "Cursor Pro", id: 1447043133
mas "DaisyDisk", id: 411643860
mas "Entity Pro", id: 1503988785
mas "Equinox", id: 1591510203
mas "iMovie", id: 408981434
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Lungo", id: 1263070803
mas "Monodraw", id: 920404675
mas "NextDNS", id: 1464122853
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Raycast Companion", id: 6738274497
mas "Refined GitHub", id: 1519867270
mas "Tampermonkey Classic", id: 1482490089
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-userscript"
vscode "antfu.icons-carbon"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "bierner.comment-tagged-templates"
vscode "bierner.folder-source-actions"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dakara.transformer"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dnicolson.binary-plist"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "loriscro.super"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wasm-wasi-core"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "ndonfris.fish-lsp"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "pustelto.bracketeer"
vscode "pveyes.aperture"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sburg.vscode-javascript-booster"
vscode "tamasfe.even-better-toml"
vscode "tldraw-org.tldraw-vscode"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "unifiedjs.vscode-remark"
vscode "vitest.explorer"
vscode "wallabyjs.quokka-vscode"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "yunduo.color-highlight-css-color-4"
vscode "zachhardesty.convert-object-to-jsx-vscode"
vscode "zengxingxin.sort-js-object-keys"
